nc: 80
scales:
  n: [0.5, 0.25, 1024]
  s: [0.5, 0.5, 1024]
  m: [0.5, 1.0, 512]
  l: [1.0, 1.0, 512]
  x: [1.0, 1.5, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, RGC_ELAN, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, RGC_ELAN, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, RGC_ELAN, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, RGC_ELAN, [1024, True]]
  - [-1, 1, FPSC, [1024]]
  - [-1, 2, C2TSSA, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, RGC_ELAN, [512, False]]
  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, RGC_ELAN, [256, False]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 2, RGC_ELAN, [512, False]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 2, RGC_ELAN, [1024, True]]
  - [[15, 18, 21], 1, Detect, [nc]]
